Autodesk.Revit.DB.ScheduleFilterType.HasNoValue
The element does not have a value for the specified parameter. No value is specified.

Autodesk.Revit.DB.ScheduleFilterType.HasValue
The element has a value for the specified parameter. No value is specified.